recipe/tests/damBreak/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          0.001;

writeControl    adjustable;

writeInterval   0.02;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           10;

maxAlphaCo      0.5;

maxDeltaT       1;

// libs ("libOGL.so");

// functions
// {
//     surfaces
//     {
//         type            surfaces;
//         libs            (geometricVoF sampling);
//         writeControl    writeTime;

//         surfaceFormat   vtp;
//         fields          (p U);

//         interpolationScheme cell;

//         surfaces
//         {
//             freeSurf
//             {
//                 type            interface;
//                 interpolate     false;
//             }
//         }
//     }
// }

// ************************************************************************* //
